app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :body))
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
INSERT INTO `comments` (`name`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('Aravind', 'This is awesome', 2, '2016-07-13 19:02:20', '2016-07-13 19:02:20')

  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
    @comment.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`post_id` = 2 AND `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1