app/controllers/posts_controller.rb

  def index
    @posts = Post.all.order('created_at DESC')
---
SELECT `posts`.* FROM `posts` ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.alumnus = current_alumnus
    if @post.save
---
INSERT INTO `posts` (`title`, `body`, `created_at`, `updated_at`) VALUES ('First Post', 'This is Aravind', '2016-07-13 09:45:00', '2016-07-13 09:45:00')

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
UPDATE `posts` SET `title` = 'Updated Post', `updated_at` = '2016-07-13 17:19:45' WHERE `posts`.`id` = 2

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2